{"author":"Amber Thomas","authorURL":"https://pudding.cool/author/amber-thomas","intro":[{"type":"text","value":"If you’re looking to add a new furry friend to your family, you may be encouraged to “adopt not shop”."},{"type":"text","value":"But where do adoptable dogs in <select class=stateSelect>Washington</select> come from?"},{"type":"text","value":"This question can be complicated, but let’s start with a dog named <span class=exampleDog>Bleu</span>."}],"dogDescOut":[{"type":"text","value":"<span class=exampleDog>Bleu</span> was one of <span class=stateTotal>1,265</span> dogs available for adoption in <span class=userState>Washington</span> on <a href=https://petfinder.com target=_blank>PetFinder</a>, June 28, 2019. But <span class=exampleDog>Bleu</span> didn’t originate in <span class=userState>Washington</span>. According to <span class=herhis>his</span> description, <span class=shehe>he</span> was brought into the state from <span class=moveCondition>a shelter in</span> <span class=dogOrigin>California</span>."},{"type":"text","value":"On the day that <span class=exampleDog>Bleu</span> was available, <span class=inPer>27%</span> of the adoptable dogs in <span class=userState>Washington</span> came into the local rescues and shelters from out of state."}],"dogDescOut2":[{"type":"text","value":"So, if these dogs weren’t strays or surrendered by their owners locally, where did they come from?"}],"dogDescIn":[{"type":"text","value":"<span class=exampleDog>Bleu</span> was one of <span class=stateTotal>1,265</span> dogs available for adoption in <span class=userState>Washington</span> on <a href=https://petfinder.com target=_blank>PetFinder</a>, June 28, 2019. And, like all the other adoptable dogs in the state, <span class=exampleDog>Bleu</span> originated in <span class=userState>Washington</span>."},{"type":"text","value":"But <span class=userState>Washington</span> is one of only 13 states that didn’t import adoptable dogs from other states or countries. In fact, <span class=userState>Washington</span> exported <span class=outTotal>55</span> adoptable pups to other states."}],"exportedTitle":"Where imported dogs in <span class=userState>Washington</span> come from","exportedSub":"Based on PetFinder data for adoptable dogs on June 28, 2019","exportNote":"<strong>Note:</strong> Each dog above is depicted by an icon that is most visually similar to the presumed primary breed of the dog. Each import into the state was determined by parsing the PetFinder description for each animal. More details in the <a href=#methods>Methods</a> section.","movementTitle":"Imports and Exports of Dogs by State","movementSub":"Based on PetFinder data for adoptable dogs on June 28, 2019","preMovement":[{"type":"text","value":"Shelters and rescue organizations have been moving animals around the country, reportedly, since the <a href=https://www.pewtrusts.org/en/research-and-analysis/blogs/stateline/2019/02/28/rescue-network-sends-southern-puppies-north target=_blank>mid 2000’s</a>, with some pointing to <a href=https://www.npr.org/2015/01/01/374257591/with-rescue-dogs-in-demand-more-shelters-look-far-afield-for-fido target=_blank>Hurricane Katrina</a> as the primary catalyst. <a href=<a href=http://content.time.com/time/nation/article/0,8599,1629962,00.html target=_blank>Evacuation plans</a> during the detrimental 2005 storm didn’t account for moving or accommodating pets or stray animals so an estimated <a href=<a href=https://www.buzzfeednews.com/article/davidhgrimm/how-hurricane-katrina-turned-pets-into-people target=_blank>250,000 animals</a> were left behind."},{"type":"text","value":"Louisiana’s SPCA and other rescue organizations from across the country worked to save an estimated 15,000 animals during the aftermath of the storm. Then these animals were <a href=https://www.la-spca.org/katrina>transported all across the country</a> to wait to be reunited with their families or to eventually find a new one."},{"type":"text","value":"Since then, <a href=https://www.congress.gov/bill/109th-congress/house-bill/3858 target=_blank>new legislation</a> has been enacted to ensure that pets are a planned part of evacuations and <a href=https://www.sierraclub.org/sierra/what-happens-animals-during-natural-disasters>rescues still work</a> during emergencies to provide safety for animals. But these days, the transport of animals goes far behind emergency response."},{"type":"text","value":"In 2018, the ASPCA reports that they relocated over <a href=https://www.aspca.org/animal-placement/animal-relocation target=_blank>40,000 animals</a> from areas of “high homeless pet overpopulation” to “areas with a higher demand for adoptable dogs”. Although our data is a snapshot of animal movement, representing all the adoptable animals available across the country on a single day, we can see geographically where animals are exported from and imported to."}],"movementNote":"<strong>Note:</strong> All dogs displayed as exported from a particular state are also depicted as imported to another state. In this graphic, there are more imports displayed than exports since some imported dogs came from outside the US. Each import into the state was determined by parsing the PetFinder description for each animal. More details in the <a href=#methods>Methods</a> section.","postMovement":[]}