{"author":"Amber Thomas","design":"Sacha Maxim","authorURL":"https://pudding.cool/author/amber-thomas","designURL":"https://pudding.cool/author/sacha-maxim","intro":[{"type":"text","value":"If you’re looking to add a new furry friend to your family, you may be encouraged to “adopt not shop”. That is, to buy your dog from a local shelter or rescue organization rather than a pet store or breeder."},{"type":"text","value":"But where do adoptable dogs in <select class=stateSelect data-condition=all>Washington</select> come from?"},{"type":"text","value":"This question can be complicated, but let’s start with a dog named <span class=exampleDog>Bleu</span>."}],"dogDescOut":[{"type":"text","value":"<span class=exampleDog>Bleu</span> was one of <span class=stateTotal>1,265</span> dogs available for adoption in <span class=userState>Washington</span> on <a href=https://petfinder.com target=_blank>PetFinder</a>, June 28, 2019. But <span class=exampleDog>Bleu</span> didn’t originate in <span class=userState>Washington</span>. According to <span class=herhis>his</span> description, <span class=shehe>he</span> was brought into the state from <span class=moveCondition>a shelter in</span> <span class=dogOrigin>California</span>."},{"type":"text","value":"On the day that <span class=exampleDog>Bleu</span> was available, <span class=inPer>27%</span> of the adoptable dogs in <span class=userState>Washington</span> came into the local rescues and shelters from out of state."}],"dogDescOut2":[{"type":"text","value":"So, if these dogs weren’t strays or surrendered by their owners locally, where did they come from? I looked at the PetFinder profiles of all 57,000 dogs available for adoption on a single day to learn more about how animals are being moved."}],"dogDescIn":[{"type":"text","value":"<span class=exampleDog>Bleu</span> was one of <span class=stateTotal>1,265</span> dogs available for adoption in <span class=userState>Washington</span>  on <a href=https://petfinder.com target=_blank>PetFinder</a>, June 28, 2019. And, like all the other adoptable dogs in the state, <span class=exampleDog>Bleu</span> originated in <span class=userState>Washington</span>."},{"type":"text","value":"But <span class=userState>Washington</span> is one of only 13 states that didn’t import adoptable dogs from other states or countries. In fact, <span class=userState>Washington</span> exported <span class=outTotal>55</span> adoptable pups to other states."}],"exportedTitle":"Where dogs brought into <select class=stateSelect data-condition=limited>Washington</select> came from","exportedSub":"Based on PetFinder data for adoptable dogs on June 28, 2019","exportNote":"<strong>Note:</strong> Each dog above is depicted by an icon that is most visually similar to the presumed primary breed of the dog. Each import into the state was determined by parsing the PetFinder description for each animal. More details in the <a href=#methods>Methods</a> section.","movementTitle":"Imports and Exports of Dogs by State","movementSub":"Based on PetFinder data for adoptable dogs on June 28, 2019","preMovement":[{"type":"text","value":"Shelters and rescue organizations have moved animals around the country, reportedly, since the <a href=https://www.pewtrusts.org/en/research-and-analysis/blogs/stateline/2019/02/28/rescue-network-sends-southern-puppies-north target=_blank>mid 2000s</a>, with some pointing to <a href=https://www.npr.org/2015/01/01/374257591/with-rescue-dogs-in-demand-more-shelters-look-far-afield-for-fido target=_blank>Hurricane Katrina</a> as the primary catalyst. <a href=<a href=http://content.time.com/time/nation/article/0,8599,1629962,00.html target=_blank>Evacuation plans</a> during the detrimental 2005 storm didn’t account for moving or accommodating pets or stray animals, so an estimated <a href=<a href=https://www.buzzfeednews.com/article/davidhgrimm/how-hurricane-katrina-turned-pets-into-people target=_blank>250,000 animals</a> were left behind."},{"type":"text","value":"Louisiana’s SPCA and other rescue organizations from across the country worked to save an estimated 15,000 animals during the aftermath of the storm. Then these animals were <a href=https://www.la-spca.org/katrina>transported all across the country</a> to wait to be reunited with their families or to eventually find a new one."},{"type":"text","value":"Since then, <a href=https://www.congress.gov/bill/109th-congress/house-bill/3858 target=_blank>new legislation</a> has been enacted to ensure that pets are a planned part of evacuations and <a href=https://www.sierraclub.org/sierra/what-happens-animals-during-natural-disasters>rescues still work</a> during emergencies to provide safety for animals. But these days, the transport of animals goes far behind emergency response."},{"type":"text","value":"In 2018, the ASPCA reports that they relocated over <a href=https://www.aspca.org/animal-placement/animal-relocation target=_blank>40,000 animals</a> from areas of “high homeless pet overpopulation” to “areas with a higher demand for adoptable dogs”. Although our data is a snapshot of animal movement, representing all the adoptable animals available across the country on a single day, we can see geographically where animals are exported from and imported to."}],"movementNote":"<strong>Note:</strong> All dogs displayed as exported from a particular state are also depicted as imported to another state. In this graphic, there are more imports displayed than exports since some imported dogs came from outside the US. Each import into the state was determined by parsing the PetFinder description for each animal. More details in the <a href=#methods>Methods</a> section.","postMovement":[{"type":"text","value":"In New England and Pacific Northwest states, rescue dogs are in demand, but sometimes in <a href=https://www.washingtonpost.com/news/animalia/wp/2017/02/08/does-america-have-enough-dogs-for-all-the-people-who-want-one/ target=_blank>short supply</a>. I’ve seen <a href=https://www.pewtrusts.org/en/research-and-analysis/blogs/stateline/2019/02/28/rescue-network-sends-southern-puppies-north target=_blank>several reports</a> of families wanting to adopt a dog, but the ones that were local and met their needs in both size or temperament were gone too quickly."},{"type":"text","value":"In southern states, it’s often the opposite. <a href=https://www.npr.org/2017/12/29/574598877/no-easy-answer-to-growing-number-of-stray-dogs-in-the-u-s-advocate-says target=_blank>Due in part</a> to less rigorous spay and neuter programs, poverty, a warmer climate expanding dogs’ breeding window, and in some cases, a different perspective on the role pets play in their families, stray dogs are very common in some areas of the south. And the shelters and rescues only have <a href=https://www.pewtrusts.org/en/research-and-analysis/blogs/stateline/2019/02/28/rescue-network-sends-southern-puppies-north target=_blank>so much</a> <a href=https://www.kvue.com/article/life/animals/were-reaching-a-breaking-point-3-austin-animal-shelters-reach-critical-capacity-waive-adoption-fees/269-21e2590a-9996-4424-abf5-20ee47759b3f target=_blank>space</a> <a href=https://www.npr.org/2014/12/31/374218425/no-kill-shelters-save-millions-of-unwanted-pets-but-not-all-of-them target=_blank>to put them</a>."},{"type":"text","value":"As the “no-kill” movement has gained momentum, euthanizing animals in shelters as a way of freeing up space has <a href=https://www.nytimes.com/2019/09/03/upshot/why-euthanasia-rates-at-animal-shelters-have-plummeted.html target=_blank>declined dramatically</a>. A <a href=https://www.msstate.edu/newsroom/article/2017/02/msu-college-veterinary-medicine-researchers-complete-canine-shelter target=_blank>2017 study</a> estimates that out of the 5.5 million dogs brought into shelters in the US annually, 780,000 (1.5%) are euthanized. (Due to <a href=https://www.npr.org/2014/12/31/374218425/no-kill-shelters-save-millions-of-unwanted-pets-but-not-all-of-them target=_blank>legitimate health and behavior concerns</a>, this number is unlikely to ever reach zero.) Animals are moved around the country to fill a need."},{"type":"text","value":"As pet owners look to rescues and shelters for their next companion and <a href=https://wjla.com/news/local/md-pet-stores-suing-ban-dog-cat-sales>state</a> <a href=https://www.nytimes.com/2019/01/02/us/california-pet-store-rescue-law.html target=_blank>legislations</a> require that pet stores only sell animals from rescues, some are starting to ask if <a href=https://www.nytimes.com/2019/06/29/sunday-review/adopt-rescue-dog-south.html target=_blank>everyone who wants a rescue dog</a> <a href=https://www.washingtonpost.com/news/animalia/wp/2017/02/08/does-america-have-enough-dogs-for-all-the-people-who-want-one/ target=_blank>can even find one</a>."},{"type":"text","value":"Cue bringing in dogs from outside the US. Out of all of the dogs we identified as imports into a new state, 12% of them came from outside the US. According to our snapshot data review, South Korea exported the 8th most dogs to states across the US, exporting 20 dogs more than Kentucky and nearly 30 more than West Virginia."}],"countriesTitle":"Exports of Dogs by State or Country","countriesSub":"Based on PetFinder data for adoptable dogs on June 28, 2019","postCountries":[{"type":"text","value":"The movement of animals both domestically and internationally has been met with a mixed bag of responses. For some, a dog in need anywhere deserves a good life and home, and they’ll do <a href=http://projectfreedomride.org/about target=_blank>anything in their power</a> to see that happen. They volunteer countless hours to <a href=http://www.vetstreet.com/our-pet-experts/weekend-warriors-the-tough-but-rewarding-work-of-driving-rescue-dogs-to-forever-homes target=_blank>driving dogs across the country</a> in search of a “forever home.” <a href=https://mashable.com/2015/04/08/volunteer-pet-rescue-flights/ target=_blank>Pilots volunteer their time</a> to fly animals. Others help to clean up and train newly imported dogs for their new families."},{"type":"text","value":"For others, there are some serious risks to this practice to consider, such as the transfer of diseases and parasites to new areas. Earlier this year, Rhode Island’s state veterinarian <a href=https://www.pewtrusts.org/en/research-and-analysis/blogs/stateline/2019/02/28/rescue-network-sends-southern-puppies-north target=_blank>told Pew</a> that, “From a pure health perspective, we shouldn’t be doing this...But it’s political now. People think they’re doing a good thing. They want to do this.” After Rhode Island’s incidence rate for the deadly (and contagious) canine parvovirus went from two incidents per year to two per week in 2012, they have a right to be worried."},{"type":"text","value":"Heartworm rates in Seattle-dwelling dogs has skyrocketed <a href=https://www.seattledogspot.com/heartworm-cases-washington-state/ target=_blank>over 300%</a> between 2012 and 2017. And while climate change and a lack of prevention may have played some role in that jump, Dr. Brian Joseph, the State Veterinarian at the Washington State Department of Agriculture, <a href=https://www.seattledogspot.com/heartworm-cases-washington-state/ target=_blank>told SeattleDogSpot</a> that rescues (either accidentally or willingly) bringing heartworm-positive dogs into the state could also share some of the blame."},{"type":"text","value":"Within the past 6 months alone, the Center for Disease Control has put a <a href=https://abcnews.go.com/Politics/cdc-block-imports-dogs-egypt-citing-rabies-concerns/story?id=62947785 target=_blank>temporary ban</a> on importing dogs from Egypt due to concerns of canine rabies (a strand eliminated from the US in 2007) and a <a href=https://beta.washingtonpost.com/science/2019/03/27/want-rescue-dog-overseas-it-might-carry-new-strain-disease-researchers-say/ target=_blank>new strain</a> of the highly contagious canine distemper virus was found on a dog imported to Canada from South Korea."},{"type":"text","value":"Transporting unhealthy dogs is, of course, not the intent of reputable rescue organizations. There are plenty that <a href=https://barkpost.com/good/npr-rescue-dogs/ target=_blank>prioritize the health</a> of the animals and <a href=https://www.aspca.org/about-us/aspca-policy-and-position-statements/position-statement-animal-transport-adoption target=_blank>require validated health records</a> before moving any animals. But since there is no regulation (or even central data collection) on animals moved within the country, less-than-reputable “rescue organizations” have emerged. Often known as “retail rescues,” these organizations buy dogs from <a href=https://www.huffpost.com/entry/national-mill-dog-rescue-puppy-mills_n_5d07cdd2e4b0953278381e02 target=_blank>“puppy mills”</a>, <a href=https://www.washingtonpost.com/graphics/2018/investigations/dog-auction-rescue-groups-donations/?noredirect=on target=_blank>dog auctions</a>, or other unsafe conditions, move them across the country, and sell them to unsuspecting families as “rescued” animals."},{"type":"text","value":"And so, we find ourselves in the gray area of moving adoptable dogs. The data we’ve presented is a single day snapshot of adoptable dogs on PetFinder. Without a central database, it’s impossible to know how many animals are moved across state lines or imported into the country. This is one attempt to take a peek at a complex situation."}],"methods":[{"type":"text","value":"Using the PetFinder API, details about all 57,190 dogs available for adoption in the US on June 28, 2019 were collected. Since PetFinder does not provide an entry field for an animal’s location before arriving at its current organization, I parsed the text of each pet’s “description”. I started by limiting text to anything that came after the word “from” but before the word “to”, or after “located in”. I then analyzed the remaining text using entity recognition from the <code>spacyR</code> <a href=https://cran.r-project.org/web/packages/spacyr/index.html target=_blank>package</a>. I manually checked the data for anything mislabeled. In all, 3,361 dogs were described as having originated in places different from where they were listed for adoption. We consider this an underestimate since any listings for animals from a vague region (e.g., “the south”, “the Carolinas”, “LA or TN”) without listing a specific state were not included in our analysis."},{"type":"text","value":"Some dogs were listed as being from several places. For example, one was described as “rescued from the euthanasia list at a tiny Alabama shelter and brought to a rescue in Georgia”, but the dog was listed as available for adoption in Massachussetts. In this case, the earliest location is the one reported."}]}